# Dataset manipulation in Python
### Prepared by: [Aki Matsuo](mailto:a.matsuo@lse.ac.uk)

* Just doing the some of the stuff done in R-lecture notes

### Long v. wide formats (Python)

*   `pandas`: https://pandas.pydata.org/pandas-docs/stable/reshaping.html

# Example from _R for Data Science_

* Example of non-tidy data

In [1]:
import pandas as pd
df_table4a = pd.read_csv("table4a.csv")
df_table4a

       country    1999    2000
0  Afghanistan     745    2666
1       Brazil   37737   80488
2        China  212258  213766

## "Gathering" = "Unstacking"

In [2]:
df_unstack = df_table4a.unstack().reset_index()
df_unstack

   level_0  level_1            0
0  country        0  Afghanistan
1  country        1       Brazil
2  country        2        China
3     1999        0          745
4     1999        1        37737
5     1999        2       212258
6     2000        0         2666
7     2000        1        80488
8     2000        2       213766

![Gathering tidy data](figs/tidy-9.png)

## "Spreading" = "Pivoting"

In [3]:
df_table2 = pd.read_csv("table2.csv")
df_table2

        country  year        type       count
0   Afghanistan  1999       cases         745
1   Afghanistan  1999  population    19987071
2   Afghanistan  2000       cases        2666
3   Afghanistan  2000  population    20595360
4        Brazil  1999       cases       37737
5        Brazil  1999  population   172006362
6        Brazil  2000       cases       80488
7        Brazil  2000  population   174504898
8         China  1999       cases      212258
9         China  1999  population  1272915272
10        China  2000       cases      213766
11        China  2000  population  1280428583

In [4]:
df_table2.pivot_table(index=['country', 'year'], columns= 'type', values='count')

type               cases  population
country     year
Afghanistan 1999     745    19987071
            2000    2666    20595360
Brazil      1999   37737   172006362
            2000   80488   174504898
China       1999  212258  1272915272
            2000  213766  1280428583

In [5]:
# or if don't like the multi-indexing of pandas' dataframe, you can do something like:
df_table2.pivot_table(index=['country', 'year'], columns= 'type', values='count').reset_index()

type      country  year   cases  population
0     Afghanistan  1999     745    19987071
1     Afghanistan  2000    2666    20595360
2          Brazil  1999   37737   172006362
3          Brazil  2000   80488   174504898
4           China  1999  212258  1272915272
5           China  2000  213766  1280428583

![](figs/tidy-8.png)